Revit 2027 API
ParameterTypeId.AnalyticalLinkReleaseTranslationX Property
 "X Translation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalLinkReleaseTranslationX { get; }
Public Shared ReadOnly Property AnalyticalLinkReleaseTranslationX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalLinkReleaseTranslationX {
	ForgeTypeId^ get ();
}
static member AnalyticalLinkReleaseTranslationX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace